---
kind: method
id: M:Autodesk.Revit.DB.DividedPath.IsValidBeginningIndent(System.Double)
source: html/0221624f-9a19-863b-28a4-2b44aea26509.htm
---
# Autodesk.Revit.DB.DividedPath.IsValidBeginningIndent Method

Checks that the indent value does not cause the beginningIndent and endIndent to overlop

## Syntax (C#)
```csharp
public bool IsValidBeginningIndent(
	double beginningIndent
)
```

## Parameters
- **beginningIndent** (`System.Double`)